Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: (Subscription required (help))..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Robert A. Millikan". IEEE Global History Network.
ne: (Subscription required (help))..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Robert A. Millikan", IEEE Global History Network, IEEE, अभिगमन मिति जुलाई २५, २०११। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Millikan, Robert Andrews (1980) [reprint of original 1950 edition].

source: IEEE. Retrieved July 25, 2011..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ Millikan, Robert Andrews (1980) [reprint of original 1950 edition]. The autobiography of Robert A. Millikan.
ne: The autobiography of Robert A. Millikan.

source: Map of the Kingdom of Macedon at the death of Philip II in 336 BC (light blue), with the original territory that existed in 431 BC (red outline), and dependent states (yellow)
ne: राजा फिलिप द्वितीयको मृत्यु अघिको मेसोडोनिया अधिराज्यको नक्सा

source: Alexander's empire and his route
ne: सिकन्दरको साम्राज्य र मार्ग

source: ↑ Hatzopoulos 1996, pp. 105–106; Roisman 2010, p. 156. ↑ Engels 2010, p. 92; Roisman 2010, p. 156. 1 2 3 Sprawski 2010, pp. 135–138; Olbrycht 2010, pp. 342–345. ↑ Hornblower 2008, pp. 55–58. ↑ Austin 2006, pp. 1–4. ↑ "Macedonia". Encyclopædia Britannica.
ne: ↑ Hatzopoulos 1996, pp. 105–106; Roisman 2010, p. 156. ↑ Engels 2010, p. 92; Roisman 2010, p. 156.

source: 23 October 2015. Archived from the original on 8 December 2008. Retrieved 5 February 2017..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} .
ne: 1 2 3 Sprawski 2010, pp. 135–138; Olbrycht 2010, pp. 342–345. ↑ Hornblower 2008, pp. 55–58. ↑ Austin 2006, pp. 1–4. ↑ "Macedonia", Encyclopædia Britannica, Encyclopædia Britannica Online, २३ अक्टोबर २०१५, ८ डिसेम्बर २००८-को मूल रूप सङ्ग्रहित, अभिगमन मिति ५ फेब्रुअरी २०१७। .mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em}.

source: The minting of silver coinage began during the reign of Alexander I as a means to pay for royal expenditures.[210] Archelaus I increased the silver content of his coins as well as minting copper coins to promote foreign and domestic commerce.[41] The minting of coinage significantly increased during the reigns of Philip II and Alexander the Great, especially after the increase in state revenues following the seizure of the Pangaion Hills.[328] During the Hellenistic period the royal houses of Macedonia, Ptolemaic Egypt, and the Kingdom of Pergamon exercised full monopolistic control over mining activities, largely to ensure the funding of their armies.[329] By the end of the conquests of Alexander the Great, nearly thirty mints stretching from Macedonia to Babylon produced standard coins.[330] The right to mint coins was shared by central and some local governments, i.e. the autonomous municipal governments of Thessaloniki, Pella, and Amphipolis within the Macedonian commonwealth.[331] The Macedonians were also the first to issue different coins for internal and external circulation.[332]
ne: चादीको सिक्का बनाउने एलेक्जेन्डर प्रथमको राज्यकालबाट सुरु भयो । यो शाही खर्चको लागि प्रयोग हुन्थ्यो ।[210] आर्किलस प्रथमले चादीको मात्र बढाए र आन्तरिक र बाह्य व्यापारको लागि तामाको सिक्काको प्रचलन ल्याए । [41]

source: Macedonia (/ˌmæsɪˈdoʊniə/ ( listen)) or Macedon (/ˈmæsɪˌdɒn/; Greek: Μακεδονία, Makedonía), was an ancient kingdom on the periphery of Archaic and Classical Greece,[4] and later the dominant state of Hellenistic Greece.[5] The kingdom was founded and initially ruled by the royal Argead dynasty, which was followed by the Antipatrid and Antigonid dynasties. Home to the ancient Macedonians, the earliest kingdom was centered on the northeastern part of the Greek peninsula,[6] and bordered by Epirus to the west, Paeonia to the north, Thrace to the east and Thessaly to the south.
ne: मेसोडोनिया (/ˌmæsɪˈdoʊniə/ ( listen)) or Macedon (/ˈmæsɪˌdɒn/; Greek: Μακεδονία, Makedonía), आर्कियाकको र ग्रीसको वरपर बसेको प्राचीन साम्राज्य हो ।[4] यो साम्राज्य रोयल आर्गियड वंशद्वारा स्थापित र पहिले शासन गरिएको थियो । पछि एण्टिप्याट्रिड र एन्टिगोनिड वंशद्वारा शासन गरिएको थियो। यो राज्य ग्रीक प्रायद्विपको उत्तर पुर्वमा,[6] पश्चिममा एपिरससँग सिमा जोडिएको थियो, उत्तरमा पायोनिया , पुर्वमा थ्रेस र दक्षिणमा थेसलीसँग जोडिएको थियो ।

source: Before the 4th century BC, Macedonia was a small kingdom outside of the area dominated by the great city-states of Athens, Sparta, and Thebes, and briefly subordinate to Achaemenid Persia.[3] During the reign of the Argead king Philip II (359–336 BC), Macedonia subdued mainland Greece and Thrace through conquest and diplomacy. With a reformed army containing phalanxes wielding the sarissa pike, Philip II defeated the old powers of Athens and Thebes in the Battle of Chaeronea in 338 BC. Philip II's son Alexander the Great, leading a federation of Greek states, accomplished his father's objective of commanding the whole of Greece when he destroyed Thebes after the city revolted.
ne: इसा पुर्वको चौथो शताब्दीअघि मेसोडोनिया एक सानो अधिराज्य थियो जसको वरपर एथेन्स, स्पार्टा, र थेब्स, र आर्किमेनिड पर्सियाको भुभाग थियो ।[3] ।आर्गियड राजा फिलिप द्वितीय (३५९-३३६ इसा पुर्व) को राज्यकालमा मेसोडोनियाले ग्रीस र थ्रेसको मुख्य भुभाग साम र दण्डले ( कुट्नीती र आक्रमण ) जित्यो ।फ्यालेन्क्स रहेका सेनाहरु सहित फिलिप द्वितीयले एथेन्स र थेब्स जस्ता पुराना शक्तिहरुलाई किरोनोयाको लडाइँमा ३३८ इसा पुर्वमा परजित गरे । फिलिप द्वितीयका पुत्र (अलेक्जेन्डर महान )ले जब थेब्स शहरले बिद्रोह गर्यो तब ग्रीसलाइ नेतृत्व गर्दै पुरै शहरलाई ध्वस्त गरे। सिकन्दरले आफ्नो राज्री विस्तारको अभियानको क्रममा , उनले आर्किमेनिड साम्राज्यको पतन गराए र भुभाग कब्जा गरे र उनले आफ्नो भुभाग सिन्धु नदि सम्म फैलाए ।उनको छोटो राज्यकालमा, उनको साम्राज्य संसारको सबैभन्दा शक्तिशाली साम्राज्य थियो । ग्रीक कला र साहित्य उनले कब्जा गरेका सबै ठाउँमा प्रचारप्रसार भयो र ग्रीक दर्शन, बास्तुकला, विज्ञान , प्रविधि संसारभरी फैलिएको थियो । विशेष गरि सिकन्दरका गुरु अरिस्टोटल ( अरस्तु )का योगदानहरु महत्त्वपूर्ण थिए जसको लेख रचनाहरु पश्चिमी दर्शनको लागि कोशेढुङा सावित बने ।

source: New cities were founded, such as Thessalonica by the usurper Cassander (named after his wife Thessalonike of Macedon).[7] Macedonia's decline began with the Macedonian Wars and the rise of Rome as the leading Mediterranean power. At the end of the Third Macedonian War in 168 BC, the Macedonian monarchy was abolished and replaced by Roman client states. A short-lived revival of the monarchy during the Fourth Macedonian War in 150–148 BC ended with the establishment of the Roman province of Macedonia.
ne: ३२३ इसा पुर्वमा सिकन्दरको मृत्यु पछि ,डाइडोसीको युद्ध भयो र सिकन्दरको छोटो समयको सम्राज्री टुक्राटुक्रामा विभाजित भयो । मेसोडोनिया भुमध्री सागर क्षेत्रमा ग्रीकको सांस्कृतिक र राजनैतिक केन्द्र रहिरह्यो . पेल्ला, पाइड्ना, र एम्फिपोलिस जस्ता महत्त्वपूर्ण शहरहरु शक्ति संघर्षमा लागिरह्यो । नयाँ शहरहरु निर्माण भए ।[7] मेसोडोनियाको युद्ध भएसँगै भुमध्य सागरको अग्रणी शक्तिको रुपमा रोमको उदय भयो र मेसोडोनियाको पतन सुरु भयो ।१६८ इसामा तेश्रो मेसोडोनिया युद्धको अन्त्यमा मेसोडोनियाको राजतन्त्रको अन्त्य भयो र रोमको सहयक रज्य बन्यो ।

source: Achievements
ne: उपलब्धि

source: Funeral of Mohammad Reza Pahlavi
ne: मोहमद रेजा पहलविको अन्त्येस्टि

source: Mohammad Reza died from complications of Waldenström's macroglobulinemia on 27 July 1980, aged 60. Egyptian President Sadat gave the Shah a state funeral.[302] In addition to members of the Pahlavi family, Anwar Sadat, Richard Nixon and Constantine II of Greece attended the funeral ceremony in Cairo.[303]
ne: मोहमद रेजाको मृत्यु २७ जुलाई १९८० मा ६० वर्षको उमेरमा भएको थियो । इजिप्टेली रास्ट्रपति सादातले शाहलाई राजकीय सम्मानका साथ अन्त्येस्ति गरे । [302] पहलवी परिवारको साथै , अनवर सादात, रिचार्ड निक्सन बिदाई समारोहमा कायरोमा उपस्थित भएका थिए ।[303]

source: Shah speaks to people about principles of White Revolution.
ne: शाह स्वेत क्रान्तिको सिद्धान्तको बारेमा जनसम्बोधन गर्दै

source: Wedding of the Shah with Farah Diba on 20 December 1959.
ne: फराह दिवा सँग शाहको विवाह २० डिसेम्बर १९५९

source: Shah Mohammad Reza with his consort and crown prince after the coronation, 1967
ne: शाह आफ्नी रानी र राजकुमारको साथ , राज्याभिषेक१९६७ मा

source: Shah visiting New York
ne: शाहको न्यु योर्क भ्रमण

source: The Shah advertised the White Revolution as a step towards modernisation
ne: आधुनिकता तर्फाको पाइलाको रुपमा स्वेत क्रान्तिको प्रचारप्रसार गर्दै शाह

source: Mohammad Reza at a press conference in Niavaran Palace, 24 January 1971
ne: पत्रकार सम्मेलनमा बोल्दै मोहमद रेजा शाह नियवरण दरबार , २४ जनवरी १९७१

source: He curbed the power of certain ancient elite factions by expropriating large and medium-sized estates for the benefit of more than four million small farmers. He took a number of other major measures, including extending suffrage to women and the participation of workers in factories through shares and other measures. In the 1970s the governmental programme of free-of-charge nourishment for children at school known as "Taghziye Rāyegan" (Persian: تغذیه رایگان) was implemented.
ne: १९६० को दशकमा मोहमद रेजा शाहले “स्वेत क्रान्ति” उल्लेख गर्दै इरानलाई आधुनिकीकरण गर्न महत्वपुर्ण सुधार गर्ने वाचा गरेका थिए । उनले महिलालाई अधिकार दिने , मजदूरलाई शेयर र अन्य माध्यम बाट सहभागी गराउने नीति ल्याए । १९७० मा उनले बच्चाहरुको लागि निशुल्क शिक्षा लागु गराए । शाहको राज्य कालमा इरानको आयाम अविस्वस्नीय वृद्धि भएको थियो ।

source: Iranian newspaper clip from 1968 reads "A quarter of Iran's nuclear energy scientists are women", a marked change in women's rights.
ne: इरानी पत्रिका १९६८ मा उल्लेख " एक चौथाई इरानी परमाणु वैज्ञानिक महिला छन् " जुनलाई महिला अधिकारमा सुधारको रुपमा हेरिएको थियो

source: Improvement of the educational system was made through the creation of new elementary schools. In addition, literacy courses were set up in remote villages by the Imperial Iranian Armed Forces, this initiative being called "Sepāh-e Dānesh" (Persian: سپاه دانش) meaning "Army of Knowledge". The Armed Forces were also engaged in infrastructural and other educational projects throughout the country "Sepāh-e Tarvij va Ābādāni" (Persian: سپاه ترویج و آبادانی) as well as in health education and promotion "Sepāh-e Behdāsht" (Persian: سپاه بهداشت).
ne: नयाँ स्कुलबाट शैक्षिक प्रणालीमा सुधार ल्याइयो । इम्पेरीयल इरानी शसस्त्र बलद्वारा साक्षरता अभियान चलाइयो । शसस्त्र बलहरुलाई देशको पूर्वाधार विकाश र शैक्षिक परियोजनामा सहभागी गराइयो । शाहले क्लर्जी हुनको लागि परिक्षा दिन संस्थाहरु बनाए । धेरै इरानी विश्वविद्यालयका विद्यार्थीहरु विदेशमा पठाइए ।

source: Between 1967 and 1977 the number of universities increased in number from 7 to 22, the number of institutions of advanced learning rose from 47 to 200, and the number of students in higher education soared from 36,742 to 100,000. Iran’s literacy programs were among the most innovative and effective anywhere in the world, so that by 1977 the number of Iranians able to read and write had climbed from just 17 percent to more than 50 percent.[213]
ne: १९६७ देखि १९७७ को बीच विश्वविद्यालयको सङ्ख्या ७ बाट २२ पुग्यो । आधुनिक शिक्षालयको सङ्ख्या ४७ बाट २०० पुग्यो । उच्च शिक्षा हासिल गर्ने विद्यार्थीको सङ्ख्या ३६,७४२ बाट १,००,००० पुग्यो[213]

source: In the field of diplomacy, Iran realised and maintained friendly relations with Western and East European countries as well as the state of Israel and China and became, especially through its close friendship with the United States, more and more a hegemonial power in the Persian Gulf region and the Middle East. The suppression of the communist guerrilla movement in the region of Dhofar in Oman with the help of the Iranian army after a formal request by Sultan Qaboos was widely regarded in this context.
ne: कुटनीतिको क्षेत्रमा इरानले पश्चिमी र पूर्वी युरोपेली देश सँग सम्बन्ध राख्यो र चीन र इजरायलसँग पनि राम्रो सम्बन्ध थियो ।

source: As to infrastructural and technological progress, the Shah continued and developed further the policies introduced by his father. His programmes included projects in technologies such as steel, telecommunications, petrochemical facilities, power plants, dams and the automobile industry. The Aryamehr University of Technology was established as a major new academic institution.[214][215][216]
ne: पूर्वाधार र प्राविधिक सफलतामा उनले आफ्ना पिताको कार्यक्रमलाई निरन्तरता दिए । उनले इस्पात (steel) दुरसंचार , पेट्रोलियम , उर्जा , बाँध र सवारी उद्योगहरुलाई आफ्नो नीतिमा समावेश गरका थिए ।[214][215][216]
